       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM-TIMES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-I    PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM ADD-ONE 5 TIMES.
           CALL "__CPROVER_assert" USING WS-I = 5.
           STOP RUN.
       ADD-ONE.
           ADD 1 TO WS-I.
