       IDENTIFICATION DIVISION.
       PROGRAM-ID. D-BIGNUM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-X       PIC 9(7)V99 VALUE 1234567.89.
       01  WS-RESULT  PIC Z,ZZZ,ZZ9.99.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE WS-X TO WS-RESULT.
           DISPLAY "[" WS-RESULT "]".
           STOP RUN.
