       IDENTIFICATION DIVISION.
       PROGRAM-ID. D-EDITED-ZERO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-RESULT  PIC ZZZ.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE 0 TO WS-RESULT.
           DISPLAY "[" WS-RESULT "]".
           STOP RUN.
