       IDENTIFICATION DIVISION.
       PROGRAM-ID. D-INITIALIZE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-RESULT  PIC X(4) VALUE 'ABCD'.
       PROCEDURE DIVISION.
       MAIN-PARA.
           INITIALIZE WS-RESULT.
           DISPLAY "[" WS-RESULT "]".
           STOP RUN.
