       IDENTIFICATION DIVISION.
       PROGRAM-ID. D-REPL-CHARS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-RESULT  PIC X(4) VALUE 'WXYZ'.
       PROCEDURE DIVISION.
       MAIN-PARA.
           INSPECT WS-RESULT REPLACING CHARACTERS BY '*'.
           DISPLAY "[" WS-RESULT "]".
           STOP RUN.
