       IDENTIFICATION DIVISION.
       PROGRAM-ID. D-REPL-FIRST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-RESULT  PIC X(5) VALUE 'XAXAX'.
       PROCEDURE DIVISION.
       MAIN-PARA.
           INSPECT WS-RESULT REPLACING FIRST 'A' BY 'B'.
           DISPLAY "[" WS-RESULT "]".
           STOP RUN.
