       IDENTIFICATION DIVISION.
       PROGRAM-ID. D-REPL-ALL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-RESULT  PIC X(7) VALUE 'A,B,C,D'.
       PROCEDURE DIVISION.
       MAIN-PARA.
           INSPECT WS-RESULT REPLACING ALL ',' BY ';'.
           DISPLAY "[" WS-RESULT "]".
           STOP RUN.
