       IDENTIFICATION DIVISION.
       PROGRAM-ID. D-REPL-LEADING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-RESULT  PIC X(6) VALUE '  12  '.
       PROCEDURE DIVISION.
       MAIN-PARA.
           INSPECT WS-RESULT REPLACING LEADING ' ' BY '0'.
           DISPLAY "[" WS-RESULT "]".
           STOP RUN.
