       IDENTIFICATION DIVISION.
       PROGRAM-ID. D-REPL-AFTER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-RESULT  PIC X(7) VALUE 'A,B=C,D'.
       PROCEDURE DIVISION.
       MAIN-PARA.
           INSPECT WS-RESULT REPLACING ALL ',' BY ';' AFTER INITIAL '='.
           DISPLAY "[" WS-RESULT "]".
           STOP RUN.
