       IDENTIFICATION DIVISION.
       PROGRAM-ID. D-STRING-DELIM2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-A       PIC X(6) VALUE 'AB::CD'.
       01  WS-RESULT  PIC X(6) VALUE SPACES.
       PROCEDURE DIVISION.
       MAIN-PARA.
           STRING WS-A DELIMITED BY '::' INTO WS-RESULT.
           DISPLAY "[" WS-RESULT "]".
           STOP RUN.
