       IDENTIFICATION DIVISION.
       PROGRAM-ID. D-STRING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-A       PIC X(2) VALUE 'AB'.
       01  WS-RESULT  PIC X(5) VALUE SPACES.
       PROCEDURE DIVISION.
       MAIN-PARA.
           STRING WS-A 'CD' 'E' DELIMITED BY SIZE INTO WS-RESULT.
           DISPLAY "[" WS-RESULT "]".
           STOP RUN.
