       IDENTIFICATION DIVISION.
       PROGRAM-ID. D-SUBTRACT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-X       PIC 9(4)V99 VALUE 500.00.
       01  WS-RESULT  PIC Z,ZZ9.99.
       PROCEDURE DIVISION.
       MAIN-PARA.
           SUBTRACT 123.45 FROM WS-X.
           MOVE WS-X TO WS-RESULT.
           DISPLAY "[" WS-RESULT "]".
           STOP RUN.
