       IDENTIFICATION DIVISION.
       PROGRAM-ID. D-UNSTRING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-SRC     PIC X(11) VALUE 'AB,CDE,F   '.
       01  WS-1       PIC X(4) VALUE SPACES.
       01  WS-2       PIC X(4) VALUE SPACES.
       01  WS-RESULT  PIC X(8) VALUE SPACES.
       PROCEDURE DIVISION.
       MAIN-PARA.
           UNSTRING WS-SRC DELIMITED BY ',' INTO WS-1 WS-2.
           STRING WS-1 '|' WS-2 DELIMITED BY SIZE INTO WS-RESULT.
           DISPLAY "[" WS-RESULT "]".
           STOP RUN.
