       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPY-REPL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY TMPL REPLACING ==(VAR)== BY ==WS-NUM==.
       PROCEDURE DIVISION.
       MAIN-PARA.
           CALL "__CPROVER_assert" USING WS-NUM = 4.
           STOP RUN.
