       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOVE-TRUNCATE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-SRC  PIC 9(6) VALUE 999999.
       01  WS-DST  PIC 9(3).
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE WS-SRC TO WS-DST.
           CALL "__CPROVER_assert" USING WS-DST = 999.
           STOP RUN.
